app/controllers/users_controller.rb

  def show
    if signed_in?
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    if signed_in?
      @users = User.search(params[:search])
---
SELECT "users".* FROM "users"